
// 2 дз 1 задание 

let season = +prompt('Введите номер месяца');


let check = (season >= 1 && season <= 2 || season == 12) ? alert('Это зима!') 
: (season >= 3 && season <= 5 ) ? alert('Это весна!')
: (season >= 6 && season <= 8 ) ? alert('Это лето!') 
: (season >= 9 && season <= 11) ? alert('Это осень!') 
: alert('Значение некорректное, попробуйте еще раз');



//2 дз 2 задание 


let l = +prompt('Введите номер единицы длины: \n1 — дециметр, \n2 — километр, \n3 — метр, \n4 — миллиметр, \n5 — сантиметр');

let d = +prompt('Введите длину данного отрезка');

switch(l) {
	case 1:
		alert('Длина отрезка в метрах равна ' + d * 0.1);
		break;

	case 2:
		alert('Длина отрезка в метрах равна ' + d * 1000);
		break;

	case 3:
		alert('Длина отрезка в метрах равна ' + d); 
		break;

	case 4:
		alert('Длина отрезка в метрах равна ' + d * 0.001); 
		break;

	case 5:
		alert('Длина отрезка в метрах равна ' + d * 0.01); 
		break;

	default:
		alert('Введенное значение некорректное');
}


//2 дз 3 задание 

let i = +prompt('Введите число лежащее в диапазоне от -999 до 999')

if (i >= -999 && i <= -100) {
	alert('Отрицательное трехзначное число');
} else if (i >= -99 && i <= -10) {
	alert('Отрицательное двухзначеное число');
} else if (i >= -9 && i <= -1) {
	alert('Отрицательное однозначное число');
} else if (i == 0) {
	alert('Нулевое число');
} else if (i >= 1 && i <= 9) {
	alert('Положительное однозначное число');
} else if (i >= 10 && i <= 99) {
	alert('Положительное двузначное число');
} else if (i >= 100 && i <= 999) {
	alert('Положительное трехзначное число');
} else {
	alert('Введенное значение некорректное');
}

//2 дз 4 задание 


for (let i = 1; i <= 100; i ++) {

	if (i % 5 === 0 && i % 3 === 0) {
		alert('ThreeFive') 
		continue;
	} else if (i % 3 === 0) {
		alert('Three') 
		continue;
	} else if (i % 5 === 0) {
		alert('Five') 
		continue; 
	}

	alert(i);
}

//2 дз 5 задание 

let year = +prompt('Введите год');

if (year % 4 === 0) {
	if (year % 100 === 0) {
		if (year % 400 === 0) {
				alert('Этот год високосный')
			} else {
				alert('Этот год обычный')
			}
	} else {
		alert('Этот год високосный');
	}

} else {
	alert('Это обычный год');
}

//2 дз 6 задание 

let plate = +prompt('Введите кол-во тарелок'); // тарелки
let soap = +prompt('Введите кол-во моющего средства'); // моющее средство

while (plate > 0) {
	alert('Осталось тарелок : ' + plate);
	alert('Осталось моющего средства : ' + (soap - 0.5));
	plate --;	
	soap -= 0.5;

	if (soap <= 0 || plate <= 0 ) break; 
} 

alert('Итого: осталось тарелок : ' + plate);
alert('Итого: осталось моющего средства : ' + soap);



